Конфигурация/DataProcessors/МенеджерОтложенныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МенеджерОтложенныхЗаданий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ОтложенныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтложенныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтложенныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерезапускатьПоИстечениюТаймаута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибкиОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивныйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СостоянияОтложенныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияОтложенныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/МенеджерОтложенныхЗаданий/Ext/ObjectModule.bsl
// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	Если Найти(ИдентификаторКоманды, "ЗапуститьОтложенныеЗадания") > 0 Тогда
		
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДатаСеанса()) Тогда
			ЗапуститьОтложенныеЗадания();
		КонецЕсли;
		
	ИначеЕсли Найти(ИдентификаторКоманды, "УдалитьДанныеОВыполненныхОтложенныхЗаданиях") > 0 Тогда
		УдалитьДанныеОВыполненныхЗаданияхНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ЗапуститьОтложенныеЗадания(КлючиЗаписи = Неопределено) Экспорт
	
	// Выберем задания в состоянии ожидания и заблокируем записи по ним.
	// В результате запроса два пакета: Новые статусы выбранных заданий и данные для запуска заданий.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТаблицаПараметров", РегистрыСведений.ОтложенныеЗадания.ПолучитьТаблицуПараметровПараллельногоЗапускаОтложенныхЗаданий());
	
	Запрос.Текст = 
	#Область Текст_запроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПараметров.Объект КАК Объект,
		|	ТаблицаПараметров.КоличествоПотоков КАК КоличествоПотоков
		|ПОМЕСТИТЬ _ТаблицаПараметров
		|ИЗ
		|	&ТаблицаПараметров КАК ТаблицаПараметров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Организация КАК Организация,
		|	ОтложенныеЗадания.Объект КАК Объект,
		|	ОтложенныеЗадания.Идентификатор КАК Идентификатор,
		|	ОтложенныеЗадания.Команда КАК Команда,
		|	ОтложенныеЗадания.Параметры КАК Параметры,
		|	ОтложенныеЗадания.Состояние КАК Состояние,
		|	ОтложенныеЗадания.Таймаут КАК Таймаут,
		|	ОтложенныеЗадания.ПерезапускатьПоИстечениюТаймаута КАК Пересоздать,
		|	ОтложенныеЗадания.ДатаДобавления КАК ДатаДобавления,
		|	ОтложенныеЗадания.ДатаЗапуска КАК ДатаЗапуска,
		|	ОтложенныеЗадания.ДатаЗапускаПлан КАК ДатаЗапускаПлан,
		|	ОтложенныеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ПОМЕСТИТЬ _Задания
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание), ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется))
		|	И НЕ ОтложенныеЗадания.ИнтерактивныйЗапуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Задания.Идентификатор КАК Идентификатор,
		|	_Задания.Организация КАК Организация,
		|	_Задания.Объект КАК Объект,
		|	_Задания.Команда КАК Команда,
		|	РАЗНОСТЬДАТ(_Задания.ДатаЗапуска, &ТекущаяДата, МИНУТА) > ВЫБОР
		|		КОГДА _Задания.Таймаут = 0
		|			ТОГДА 5
		|		ИНАЧЕ _Задания.Таймаут
		|	КОНЕЦ КАК Зависло,
		|	_Задания.Пересоздать КАК Пересоздать,
		|	_Задания.Состояние КАК Состояние,
		|	_Задания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ПОМЕСТИТЬ _ЗаданияВРаботе
		|ИЗ
		|	_Задания КАК _Задания
		|ГДЕ
		|	_Задания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Задания.Организация КАК Организация,
		|	_Задания.Объект КАК Объект,
		|	_Задания.Идентификатор КАК Идентификатор,
		|	_Задания.Команда КАК Команда,
		|	МАКСИМУМ(ЕСТЬNULL(_ТаблицаПараметров.КоличествоПотоков, 1)) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЗаданияВРаботе.ИдентификаторФоновогоЗадания) КАК КоличествоПотоков
		|ПОМЕСТИТЬ _ЗаданияВОжидании
		|ИЗ
		|	_Задания КАК _Задания
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаПараметров КАК _ТаблицаПараметров
		|		ПО _Задания.Объект = _ТаблицаПараметров.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаданияВРаботе КАК _ЗаданияВРаботе
		|		ПО _Задания.Объект = _ЗаданияВРаботе.Объект
		|			И _Задания.Организация = _ЗаданияВРаботе.Организация
		|			И (_ЗаданияВРаботе.Пересоздать
		|				ИЛИ НЕ _ЗаданияВРаботе.Зависло)
		|ГДЕ
		|	_Задания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание)
		|	И &УсловиеНаИдентификатор
		|	И &УсловиеНаДатуЗапуска
		|
		|СГРУППИРОВАТЬ ПО
		|	_Задания.Организация,
		|	_Задания.Объект,
		|	_Задания.Команда,
		|	_Задания.Идентификатор
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ЕСТЬNULL(_ТаблицаПараметров.КоличествоПотоков, 1)) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЗаданияВРаботе.ИдентификаторФоновогоЗадания) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаданияВОжидании.Организация КАК Организация,
		|	_ЗаданияВОжидании.Объект КАК Объект,
		|	_ЗаданияВОжидании.Идентификатор КАК Идентификатор,
		|	_ЗаданияВОжидании.Команда КАК Команда,
		|	_ЗаданияВОжидании.КоличествоПотоков КАК КоличествоПотоков,
		|	КОЛИЧЕСТВО(_ЗаданияВОжидании1.Идентификатор) КАК НомерЗадания,
		|	КОЛИЧЕСТВО(_ЗаданияВОжидании1.Идентификатор) - (ВЫРАЗИТЬ(КОЛИЧЕСТВО(_ЗаданияВОжидании1.Идентификатор) / _ЗаданияВОжидании.КоличествоПотоков КАК ЧИСЛО(10, 0))) * _ЗаданияВОжидании.КоличествоПотоков КАК РазделительПотоков
		|ПОМЕСТИТЬ _ЗаданияПоПотокам
		|ИЗ
		|	_ЗаданияВОжидании КАК _ЗаданияВОжидании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗаданияВОжидании КАК _ЗаданияВОжидании1
		|		ПО _ЗаданияВОжидании.Объект = _ЗаданияВОжидании1.Объект
		|			И _ЗаданияВОжидании.Идентификатор >= _ЗаданияВОжидании1.Идентификатор
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗаданияВОжидании.Объект,
		|	_ЗаданияВОжидании.Организация,
		|	_ЗаданияВОжидании.Идентификатор,
		|	_ЗаданияВОжидании.Команда,
		|	_ЗаданияВОжидании.КоличествоПотоков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.Команда КАК Команда,
		|	ВложенныйЗапрос.РазделительПотоков КАК РазделительПотоков
		|ПОМЕСТИТЬ _ОграничительПотоков
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ЗаданияВРаботе.Организация КАК Организация,
		|		_ЗаданияВРаботе.Объект КАК Объект,
		|		_ЗаданияВРаботе.Команда КАК Команда,
		|		НЕОПРЕДЕЛЕНО КАК РазделительПотоков,
		|		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗапускаПлан
		|	ИЗ
		|		_ЗаданияВРаботе КАК _ЗаданияВРаботе
		|	ГДЕ
		|		(НЕ _ЗаданияВРаботе.Зависло
		|				ИЛИ _ЗаданияВРаботе.Пересоздать)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗаданияПоПотокам.Организация,
		|		_ЗаданияПоПотокам.Объект,
		|		_ЗаданияПоПотокам.Команда,
		|		_ЗаданияПоПотокам.РазделительПотоков,
		|		МИНИМУМ(_Задания.ДатаЗапускаПлан)
		|	ИЗ
		|		_ЗаданияПоПотокам КАК _ЗаданияПоПотокам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Задания КАК _Задания
		|			ПО _ЗаданияПоПотокам.Объект = _Задания.Объект
		|				И _ЗаданияПоПотокам.Команда = _Задания.Команда
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ЗаданияПоПотокам.Организация,
		|		_ЗаданияПоПотокам.Объект,
		|		_ЗаданияПоПотокам.Команда,
		|		_ЗаданияПоПотокам.РазделительПотоков) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.ДатаЗапускаПлан
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЗаданияВРаботе.Организация КАК Организация,
		|	_ЗаданияВРаботе.Идентификатор КАК Идентификатор,
		|	НЕОПРЕДЕЛЕНО КАК Объект,
		|	_ЗаданияВРаботе.Пересоздать КАК Пересоздать,
		|	_ЗаданияВРаботе.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ИЗ
		|	_ЗаданияВРаботе КАК _ЗаданияВРаботе
		|ГДЕ
		|	_ЗаданияВРаботе.Зависло
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ЗаданияВОжидании.Организация,
		|	_ЗаданияВОжидании.Идентификатор,
		|	_ЗаданияВОжидании.Объект,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_ЗаданияВОжидании КАК _ЗаданияВОжидании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОграничительПотоков КАК _ОграничительПотоков
		|		ПО _ЗаданияВОжидании.Объект = _ОграничительПотоков.Объект
		|			И _ЗаданияВОжидании.Команда = _ОграничительПотоков.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаданияПоПотокам.Организация КАК Организация,
		|	_ЗаданияПоПотокам.Объект КАК Объект,
		|	_ЗаданияПоПотокам.Команда КАК Команда,
		|	_ЗаданияПоПотокам.РазделительПотоков КАК РазделительПотоков,
		|	_ЗаданияПоПотокам.Идентификатор КАК Идентификатор,
		|	_Задания.Параметры КАК Параметры,
		|	_Задания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ИЗ
		|	_ЗаданияПоПотокам КАК _ЗаданияПоПотокам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Задания КАК _Задания
		|		ПО _ЗаданияПоПотокам.Идентификатор = _Задания.Идентификатор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОграничительПотоков КАК _ОграничительПотоков
		|		ПО _ЗаданияПоПотокам.Объект = _ОграничительПотоков.Объект
		|			И _ЗаданияПоПотокам.Команда = _ОграничительПотоков.Команда
		|			И _ЗаданияПоПотокам.РазделительПотоков = _ОграничительПотоков.РазделительПотоков
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Объект,
		|	Команда,
		|	РазделительПотоков
		|ИТОГИ ПО
		|	Организация,
		|	Объект,
		|	Команда,
		|	РазделительПотоков";		
	#КонецОбласти 
	
	Если КлючиЗаписи <> Неопределено Тогда
	
		Идентификаторы = Новый Массив;
		
		Для Каждого ТекКлюч Из КлючиЗаписи Цикл
			Идентификаторы.Добавить(ТекКлюч.Идентификатор);
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаИдентификатор", "_Задания.Идентификатор В(&Идентификаторы)");
		Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
		Запрос.УстановитьПараметр("УсловиеНаДатуЗапуска", Истина);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаДатуЗапуска", "_Задания.ДатаЗапускаПлан <= &ТекущаяДата");
		Запрос.УстановитьПараметр("УсловиеНаИдентификатор", Истина);
		
	КонецЕсли;
	
	#Область Изменение_статусов
	
	НачатьТранзакцию();
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ЗаданияКИзменениюСтатусаРезультат = МассивРезультатов[МассивРезультатов.ВГраница()-1];
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтложенныеЗадания");
	ЭлементБлокировки.ИсточникДанных = ЗаданияКИзменениюСтатусаРезультат;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	Выборка = ЗаданияКИзменениюСтатусаРезультат.Выбрать();
	
	ЕстьЗаданияКЗапуску = Ложь;
	НезапускаемыеЗадания = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Объект = Неопределено Тогда
			// это зависшие задания
			// проверяем зависло ли на самом деле, завершаем
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторФоновогоЗадания);
			Если ФоновоеЗадание = Неопределено Или ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
				РаботаСРегламентнымиЗаданиями.ОтменитьОтложенноеЗадание(Выборка.Идентификатор, "Задание отменено, т.к. превышен таймаут.", Выборка.Пересоздать);
			КонецЕсли; 
		Иначе
			ЕстьЗаданияКЗапуску = Истина;
			Если НЕ РаботаСРегламентнымиЗаданиями.ЗафиксироватьЗапускОтложенногоЗадания(Выборка.Идентификатор) Тогда
				НезапускаемыеЗадания.Добавить(Выборка.Идентификатор);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось зафкисировать запуск отложенного задания '"
																	+ Выборка.Объект + "' с идентификатором '" + Выборка.Идентификатор + "'!");
			КонецЕсли;
																
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЗафиксироватьТранзакцию(); 
	
	#КонецОбласти
	
	Если Не ЕстьЗаданияКЗапуску Тогда
		// подумать
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запуск заданий не был выполнен! Обнаружены запущенные отложенные задания.");
		Возврат;
	КонецЕсли;
	
	// Запустим задания.
	ОрганизацииКЗапуску = МассивРезультатов[МассивРезультатов.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ОрганизацииКЗапуску.Следующий() Цикл
		
		ОбъектыКЗапуску = ОрганизацииКЗапуску.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ОбъектыКЗапуску.Следующий() Цикл
			
			КомандыКЗапуску = ОбъектыКЗапуску.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока КомандыКЗапуску.Следующий() Цикл
				
				ПотокиКЗапуску = КомандыКЗапуску.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ПотокиКЗапуску.Следующий() Цикл
					
					ЗапуститьЗадание(ПотокиКЗапуску, НезапускаемыеЗадания);
									
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗапуститьЗадание(ПотокиКЗапуску, НезапускаемыеЗадания)

	Экземпляры = ПолучитьЭкземплярыЗадания(ПотокиКЗапуску, НезапускаемыеЗадания);
	
	Если Экземпляры.Количество() > 0 Тогда
		
		// запускаем задание
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(ПотокиКЗапуску.Объект);
		ПараметрыМетода.Добавить(ПотокиКЗапуску.Команда);
		ПараметрыМетода.Добавить(Экземпляры);
		
		Если ТипЗнч(ПотокиКЗапуску.Объект) = Тип("Строка") Тогда
			НаименованиеЗадания = ПотокиКЗапуску.Объект;
		Иначе
			НаименованиеЗадания = ПотокиКЗапуску.Объект.Наименование;
		КонецЕсли;
		
		НаименованиеЗадания = "Запуск отложенного задания: " + НаименованиеЗадания + " ('" + ПотокиКЗапуску.Команда + "')";
		
		ФоновыеЗадания.Выполнить("РаботаСРегламентнымиЗаданиями.ЗапуститьОтложенноеЗадание", ПараметрыМетода, Новый УникальныйИдентификатор(), НаименованиеЗадания);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьЭкземплярыЗадания(ПотокиКЗапуску, НезапускаемыеЗадания)

	Экземпляры = Новый ТаблицаЗначений;
				
	Экземпляры.Колонки.Добавить("Идентификатор");
	Экземпляры.Колонки.Добавить("Параметры");
	
	Выборка = ПотокиКЗапуску.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НезапускаемыеЗадания.Найти(Выборка.Идентификатор) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
				  				
		// собираем таблицу параметров
		НовоеЗадание = Экземпляры.Добавить();
		
		НовоеЗадание.Идентификатор	= Выборка.Идентификатор;
		НовоеЗадание.Параметры		= Выборка.Параметры.Получить();
		
	КонецЦикла;

	Возврат Экземпляры;
	
КонецФункции

// Необходимо перенести в общий модуль.
Процедура УдалитьДанныеОВыполненныхЗаданияхНаСервере() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Завершено)");
	
	НачатьТранзакцию();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОтложенныеЗадания");
	ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ РаботаСРегламентнымиЗаданиями.УдалитьДанныеОЗадании(Выборка.Идентификатор) Тогда
			
			ОтменитьТранзакцию();
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
